def caching_fibonacci():
    """
    Функція створює замикання для обчислення чисел Фібоначчі з кешуванням результатів.
    Повертає внутрішню функцію fibonacci(n), яка використовує кеш для збереження проміжних результатів.
    """

    # створюємо порожній кеш у вигляді словника
    cache = {}

    def fibonacci(n):        
        #Обчислює n-те число Фібоначчі рекурсивно з кешуванням результатів.
        
        # базові випадки
        if n <= 0:
            return 0
        elif n == 1:
            return 1

        # якщо значення вже є у кеші — повертаємо його
        if n in cache:
            return cache[n]

        # якщо нема — обчислюємо рекурсивно і зберігаємо у кеш
        cache[n] = fibonacci(n - 1) + fibonacci(n - 2)

        return cache[n]

    # повертаємо саму функцію fibonacci (замикання)
    return fibonacci


# Приклад використання:
fib = caching_fibonacci()
print(fib(10))  # Виведе 55 - це 10 елемент у ряді Фібо
print(fib(15))  # Виведе 610 - це 15 елемент у ряді Фібо
print(fib(3))   # Виведе 2 - це 3 елемент у ряді Фібо

